dataframe from list

In [88]:
list1 = 'A B C D E F G H I J '.split()
list1

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

In [89]:
import pandas as pd
import numpy as np
# from numpy.random import randn

In [90]:
df = pd.DataFrame(randn(5,10),index = ("Ade Yomi Seun Kole Dada".split()), columns=(list1))

In [91]:
df

,A,B,C,D,E,F,G,H,I,J
Ade,1.556014,1.283492,1.219083,-0.068279,1.274275,0.439598,2.484831,-0.087425,0.076179,0.316041
Yomi,1.848987,1.084186,0.304392,-1.963178,0.168912,1.238792,-0.463515,-0.418040,-0.713752,0.809542
Seun,-0.345422,-0.789942,-0.715915,0.776052,0.340507,-1.048108,0.307990,-1.130344,0.915014,0.304013
Kole,-0.341430,-1.150148,-0.958460,1.144588,-1.591994,0.177086,1.476179,0.255654,-0.859332,-0.338498
Dada,-0.754438,0.364500,-0.636352,1.637177,-1.190138,0.978400,0.362250,0.881764,1.692161,-0.775406

In [92]:
df["A"]

Ade     1.556014
Yomi    1.848987
Seun   -0.345422
Kole   -0.341430
Dada   -0.754438
Name: A, dtype: float64

In [93]:
df[["A","B"]]

             A         B
Ade   1.556014  1.283492
Yomi  1.848987  1.084186
Seun -0.345422 -0.789942
Kole -0.341430 -1.150148
Dada -0.754438  0.364500

In [94]:
df.loc["Ade"]

A    1.556014
B    1.283492
C    1.219083
D   -0.068279
E    1.274275
F    0.439598
G    2.484831
H   -0.087425
I    0.076179
J    0.316041
Name: Ade, dtype: float64

In [95]:
df.iloc[3]

A   -0.341430
B   -1.150148
C   -0.958460
D    1.144588
E   -1.591994
F    0.177086
G    1.476179
H    0.255654
I   -0.859332
J   -0.338498
Name: Kole, dtype: float64

In [96]:
df[df>0]

,A,B,C,D,E,F,G,H,I,J
Ade,1.556014,1.283492,1.219083,NaN,1.274275,0.439598,2.484831,NaN,0.076179,0.316041
Yomi,1.848987,1.084186,0.304392,NaN,0.168912,1.238792,NaN,NaN,NaN,0.809542
Seun,NaN,NaN,NaN,0.776052,0.340507,NaN,0.307990,NaN,0.915014,0.304013
Kole,NaN,NaN,NaN,1.144588,NaN,0.177086,1.476179,0.255654,NaN,NaN
Dada,NaN,0.364500,NaN,1.637177,NaN,0.978400,0.362250,0.881764,1.692161,NaN

In [97]:
df[df["A"]>1]

,A,B,C,D,E,F,G,H,I,J
Ade,1.556014,1.283492,1.219083,-0.068279,1.274275,0.439598,2.484831,-0.087425,0.076179,0.316041
Yomi,1.848987,1.084186,0.304392,-1.963178,0.168912,1.238792,-0.463515,-0.418040,-0.713752,0.809542

In [98]:
df[df['A']>0]['C']

Ade     1.219083
Yomi    0.304392
Name: C, dtype: float64

unkown

In [99]:
df[(df['B']>1) | (df['H'] > 1)]

,A,B,C,D,E,F,G,H,I,J
Ade,1.556014,1.283492,1.219083,-0.068279,1.274275,0.439598,2.484831,-0.087425,0.076179,0.316041
Yomi,1.848987,1.084186,0.304392,-1.963178,0.168912,1.238792,-0.463515,-0.418040,-0.713752,0.809542

In [41]:
df.reset_index()

,index,A,B,C,D,E,F,G,H,I,J
0,Ade,-0.563575,0.018375,-1.067604,1.427583,-1.265372,-0.211609,1.784409,2.231918,0.313904,0.399908
1,Yomi,0.134932,0.781239,-0.175847,0.860032,0.893148,0.472390,-0.456037,0.359426,-2.834607,-1.141032
2,Seun,1.780669,-1.439544,0.747105,-0.136135,-0.083454,0.432288,-0.683357,-0.057808,0.165380,-1.604855
3,Kole,0.056473,0.519014,-0.307626,1.737417,-0.330875,0.340686,-1.288953,1.593502,-1.728174,0.092127
4,Dada,0.978323,-0.689861,1.670321,-0.937943,-1.463190,-1.416885,1.293606,-1.615331,0.411165,0.137645

# series

In [42]:
my_list = [2,3,5,7,9,0]

In [52]:
pd.Series(my_list,  "s a m p l e".split())

s    2
a    3
m    5
p    7
l    9
e    0
dtype: int64

In [55]:
dictionary1 = {'a' : 6, 'b':['fat', 6], 'c':"has"}

In [56]:
dictionary1

{'a': 6, 'b': ['fat', 6], 'c': 'has'}

In [57]:
pd.Series(dictionary1)

a           6
b    [fat, 6]
c         has
dtype: object

# missing data

In [63]:
df = pd.DataFrame({'A':[1,2,np.nan,8,6],
                  'B':[5,np.nan,np.nan,4,0],
                  'C':[1,2,3,9,80]})

In [61]:
df

     A    B   C
0  1.0  5.0   1
1  2.0  NaN   2
2  NaN  NaN   3
3  8.0  4.0   9
4  6.0  0.0  80

In [66]:
df.dropna(axis = 0)

     A    B   C
0  1.0  5.0   1
3  8.0  4.0   9
4  6.0  0.0  80

In [67]:
df.dropna(axis = 1)

    C
0   1
1   2
2   3
3   9
4  80

In [86]:
df.dropna(thresh=1, axis = 1)

     A    B   C
0  1.0  5.0   1
1  2.0  NaN   2
2  NaN  NaN   3
3  8.0  4.0   9
4  6.0  0.0  80

In [79]:
df.fillna(value = df.std(), axis=0)

          A         B   C
0  1.000000  5.000000   1
1  2.000000  2.645751   2
2  3.304038  2.645751   3
3  8.000000  4.000000   9
4  6.000000  0.000000  80

In [82]:
df.fillna(value = df.mean())

      A    B   C
0  1.00  5.0   1
1  2.00  3.0   2
2  4.25  3.0   3
3  8.00  4.0   9
4  6.00  0.0  80

In [83]:
df

     A    B   C
0  1.0  5.0   1
1  2.0  NaN   2
2  NaN  NaN   3
3  8.0  4.0   9
4  6.0  0.0  80

In [85]:
df['B'].fillna(value = df['B'].mean())

0    5.0
1    3.0
2    3.0
3    4.0
4    0.0
Name: B, dtype: float64